// Options the user could type in
const prompts = [
  ["مالك"],
  ["السلام عليكم"],
  ["اهلا", "هلا",  "صباح الخير", "مساء الخير","مرحبا"],
  ["كيف حالك", "كيف الحياة", "كيف الأمور"],
  ["كم عمرك"],
  ["من انت", "انت انسان", "انت روبوت", "انت إنسان او الروبوت"],
  ["من خلقك", "من صنعك"],
  [
    "اسمك",
    "اعرف اسمك",
    "ما اسمك",
    "شو اسمك",
    "تسمي نفسك"
  ],
  ["احبك","بحبك"],
  ["سعيد", "حسن", "مرح", "رائع","الحمد لله","الحمدلله","تمام"],
  ["سيء", "ضجر", "مرهق","تعبان","مش كويس"],
  ["وداعا", "بشوفك بعدين", "مع السلامة", "أراك لاحقا"],
  [""],
]

// Possible responses, in corresponding order

const replies = [
  [":D شخص مدهش"],
  ["و عليكم السلام"],
  ["مرحبا", "أهلا"],
  [
    "جيد، وكيف حالك؟",
    "رائع، كيف حالك؟"
  ],
  ["أنا عمري 4 أيام"],
  ["أنا مجرد روبوت"],
  ["المطور الحقيقي الوحيد ، مالك"],
  ["ليس لدي إسم"],
  ["أنا أيضا أحبك"],
  ["سعيد لسماع هذا"],
  ["لماذا ا؟ لا يجب عليك!"],
  ["وداعا", "مع السلامة", "أراك لاحقا"],
  ["آسف لم أتمكن من قراءة ذلك ، يرجى محاولة إعادة صياغته"],
]

// Random for any other user input

const alternative = [
  "آسف لم أتمكن من قراءة ذلك ، يرجى محاولة إعادة صياغته"
]
